Catalogs/УНСФ_ПозицииСмет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>УНСФ_ПозицииСмет</Name>
			<Hierarchical>true</Hierarchical>
			<Owners>
				<xr:Item>Catalog.УНСФ_Смета</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОД_СтарыйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОД_СтарыйКодРодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазделСметы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расценка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УНСФ_СметныеРасценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаПозиции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УНСФ_ТипОбъемаРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаМатериалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаРесурсов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаПозицииФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>22</v8:Digits>
									<v8:FractionDigits>10</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УНСФ_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УНСФ_ПозицииСмет/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
&Вместо("ПересчитатьСуммыТабличныхЧастей")
Процедура ОД_ПересчитатьСуммыТабличныхЧастей()
	
	//=======================================================================================
	
	////БЫЛО
	//Для Каждого СтрокаТЧ Из Объект.Материалы Цикл
	//	
	//	СтрокаТЧ.КоличествоВсего = СтрокаТЧ.Количество * Объект.Объем;
	//	СтрокаТЧ.Сумма = СтрокаТЧ.КоличествоВсего * СтрокаТЧ.Цена;
	//	                                        
	//КонецЦикла;  	
	//
	//Для Каждого СтрокаТЧ Из Объект.Ресурсы Цикл
	//	
	//	СтрокаТЧ.КоличествоВсего = СтрокаТЧ.Количество * Объект.Объем;
	//	СтрокаТЧ.Сумма = СтрокаТЧ.КоличествоВсего * СтрокаТЧ.Цена;
	//	
	//КонецЦикла;
	//
	//Объект.СуммаПозиции = Объект.Материалы.Итог("Сумма")+Объект.Ресурсы.Итог("Сумма");
	
	//=======================================================================================
	
	////СТАЛО  
	
	Для Каждого СтрокаТЧ Из Объект.Материалы Цикл
		
		Если СтрокаТЧ.Номенклатура.ОД_Неокругляемый Тогда
			СтрокаТЧ.КоличествоВсего = СтрокаТЧ.Количество * Объект.Объем;
			СтрокаТЧ.КоличествоВсего = ?(Цел(СтрокаТЧ.КоличествоВсего) = СтрокаТЧ.КоличествоВсего, СтрокаТЧ.КоличествоВсего, Цел(СтрокаТЧ.КоличествоВсего) + 1);
			
			Если СтрокаТЧ.КоличествоВсего < СтрокаТЧ.Номенклатура.ОД_КратностьОкругления Тогда
				СтрокаТЧ.КоличествоВсего = СтрокаТЧ.Номенклатура.ОД_КратностьОкругления;	
			КонецЕсли;
			
			Если СтрокаТЧ.КоличествоВсего % СтрокаТЧ.Номенклатура.ОД_КратностьОкругления <> 0 Тогда
				СтрокаТЧ.КоличествоВсего = СтрокаТЧ.КоличествоВсего + СтрокаТЧ.Номенклатура.ОД_КратностьОкругления - (СтрокаТЧ.КоличествоВсего % СтрокаТЧ.Номенклатура.ОД_КратностьОкругления);	
			КонецЕсли;
			
			//СтрокаТЧ.Сумма = (СтрокаТЧ.КоличествоВсего * СтрокаТЧ.Цена) / СтрокаТЧ.Количество;
			СтрокаТЧ.Сумма = СтрокаТЧ.КоличествоВсего * СтрокаТЧ.Цена;
		Иначе
			СтрокаТЧ.КоличествоВсего = СтрокаТЧ.Количество * Объект.Объем;
			СтрокаТЧ.Сумма = СтрокаТЧ.КоличествоВсего * СтрокаТЧ.Цена;
		КонецЕсли;
		
		                                        
	КонецЦикла;  	
	
	Для Каждого СтрокаТЧ Из Объект.Ресурсы Цикл
		
		СтрокаТЧ.КоличествоВсего = СтрокаТЧ.Количество * Объект.Объем;
		СтрокаТЧ.Сумма = СтрокаТЧ.КоличествоВсего * СтрокаТЧ.Цена;
		
	КонецЦикла;
	
	Объект.СуммаПозиции = Объект.Материалы.Итог("Сумма")+Объект.Ресурсы.Итог("Сумма");
	
	//=======================================================================================
	
	
	
КонецПроцедуры
